wolgwang1729/SoB-SeedSigner-Bootloader-Journey/Phase_12/seedsigner_bootloader_p4_stateless_os/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_PARTITION_TABLE_OFFSET=0x20000
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_FREERTOS_UNICORE=y
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y

# Secure Boot V2 — the 2nd-stage bootloader verifies the app loader
# (seedsigner_secure_loader.bin) against the eFuse-stored key digest on every
# boot, so a malicious or wrong loader image in flash is rejected before it can
# run. The loader itself then verifies the SD-card payload via secp256k1
# multisig. (Same scheme as Phase 9.)
CONFIG_SECURE_BOOT=y
CONFIG_SECURE_BOOT_V2_ENABLED=y
CONFIG_SECURE_BOOT_SUPPORTS_RSA=y
CONFIG_SECURE_SIGNED_ON_BOOT=y
# 'n' means we DO require RSA signatures (double negative)
CONFIG_SECURE_SIGNED_APPS_NO_RSA_SIGN=n
CONFIG_SECURE_BOOT_SIGNING_KEY="secure_boot_signing_key.pem"
CONFIG_SECURE_SIGNED_APPS_RSA_SCHEME=y
CONFIG_SECURE_SIGNED_APPS_ECDSA_SCHEME=n

# FatFs: long filename support — the payload bundle is seedsigner_esp32p4.bin
# (22 chars, > 8.3). The FatFs default (LFN_NONE) matches short names only, so
# the SD read would fail with "Firmware file ... not found" despite a good mount.
CONFIG_FATFS_LFN_HEAP=y

# ESP32-P4 specific chip revision (v1.3 board support)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# eFuses: simulate all reads/writes in RAM — no physical eFuse is ever burned.
# Safe dev mode for experimenting with secure-boot/flash-encryption provisioning
# on real silicon.
# KEEP_IN_FLASH persists the virtual state across reboots in the 'efuse' data
# partition (same setup as Phase 9).
CONFIG_EFUSE_VIRTUAL=y
CONFIG_EFUSE_VIRTUAL_KEEP_IN_FLASH=y
CONFIG_EFUSE_VIRTUAL_LOG_ALL_WRITES=y

# PSRAM support (ESP32-P4 dev board has PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Disable PMP IDRAM split — our loader needs to overwrite IRAM at 0x4FF00000
# with the payload's code. The default split marks IRAM as execute-only with
# LOCKED PMP entries that can't be modified at runtime.
CONFIG_ESP_SYSTEM_PMP_IDRAM_SPLIT=n
CONFIG_ESP_ENABLE_PVT=n
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
